#include <stdio.h>
#include <stdbool.h>

void basic_printf_series() {
    int i  = 10;
    int *p = &i;

    // ------------------------------------------------------------------
    // printf() -- 最もよく利用されるもの。標準出力に出力される。
    // ------------------------------------------------------------------
    printf("[printf ] %d\t%d\t%s\t%p\n", 1, true, "helloworld", p);

    // ------------------------------------------------------------------
    // fprintf() -- ストリームを指定して出力する。
    // ------------------------------------------------------------------
    fprintf(stderr, "[fprintf] %d\t%d\t%s\t%p\n", 1, true, "helloworld", p);

    // ------------------------------------------------------------------
    // sprintf() -- 出力データを設定するバッファを指定して出力する。
    // ------------------------------------------------------------------
    char buffer[256] = {0};
    sprintf(buffer, "[sprintf] %d\t%d\t%s\t%p\n", 1, true, "helloworld", p);
    printf("%s", buffer);
}